; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x))))

; problem
(define (problem BLOCKS-13-1)
(:domain BLOCKS)
(:objects I M G H L A C D E K F B J - block)
(:init (CLEAR J) (CLEAR B) (ONTABLE F) (ONTABLE K) (ON J E) (ON E D) (ON D C)
 (ON C A) (ON A L) (ON L H) (ON H G) (ON G M) (ON M I) (ON I F) (ON B K)
 (HANDEMPTY))
(:goal (and (ON D A) (ON A E) (ON E L) (ON L M) (ON M C) (ON C J) (ON J F)
            (ON F K) (ON K G) (ON G H) (ON H I) (ON I B)))
)

; plan
1. (unstack b k)
   deleted: (clear b) (handempty) (on b k)
   added: (holding b) (clear k)
   goals met: 0 of 12
2. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 0 of 12
3. (unstack j e)
   deleted: (clear j) (handempty) (on j e)
   added: (holding j) (clear e)
   goals met: 0 of 12
4. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 0 of 12
5. (unstack e d)
   deleted: (clear e) (handempty) (on e d)
   added: (holding e) (clear d)
   goals met: 0 of 12
6. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 0 of 12
7. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 12
8. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 0 of 12
9. (unstack c a)
   deleted: (clear c) (handempty) (on c a)
   added: (holding c) (clear a)
   goals met: 0 of 12
10. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 0 of 12
11. (unstack a l)
   deleted: (clear a) (handempty) (on a l)
   added: (holding a) (clear l)
   goals met: 0 of 12
12. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 0 of 12
13. (unstack l h)
   deleted: (clear l) (handempty) (on l h)
   added: (holding l) (clear h)
   goals met: 0 of 12
14. (stack l a)
   deleted: (holding l) (clear a)
   added: (clear l) (handempty) (on l a)
   goals met: 0 of 12
15. (unstack h g)
   deleted: (clear h) (handempty) (on h g)
   added: (holding h) (clear g)
   goals met: 0 of 12
16. (stack h l)
   deleted: (holding h) (clear l)
   added: (clear h) (handempty) (on h l)
   goals met: 0 of 12
17. (unstack g m)
   deleted: (clear g) (handempty) (on g m)
   added: (holding g) (clear m)
   goals met: 0 of 12
18. (stack g e)
   deleted: (holding g) (clear e)
   added: (clear g) (handempty) (on g e)
   goals met: 0 of 12
19. (unstack m i)
   deleted: (clear m) (handempty) (on m i)
   added: (holding m) (clear i)
   goals met: 0 of 12
20. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 0 of 12
21. (unstack i f)
   deleted: (clear i) (handempty) (on i f)
   added: (holding i) (clear f)
   goals met: 0 of 12
22. (stack i b)
   deleted: (holding i) (clear b)
   added: (clear i) (handempty) (on i b)
   goals met: 1 of 12
23. (unstack h l)
   deleted: (clear h) (handempty) (on h l)
   added: (holding h) (clear l)
   goals met: 1 of 12
24. (stack h i)
   deleted: (holding h) (clear i)
   added: (clear h) (handempty) (on h i)
   goals met: 2 of 12
25. (unstack g e)
   deleted: (clear g) (handempty) (on g e)
   added: (holding g) (clear e)
   goals met: 2 of 12
26. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 3 of 12
27. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 3 of 12
28. (stack k g)
   deleted: (holding k) (clear g)
   added: (clear k) (handempty) (on k g)
   goals met: 4 of 12
29. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 4 of 12
30. (stack f k)
   deleted: (holding f) (clear k)
   added: (clear f) (handempty) (on f k)
   goals met: 5 of 12
31. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 5 of 12
32. (stack j f)
   deleted: (holding j) (clear f)
   added: (clear j) (handempty) (on j f)
   goals met: 6 of 12
33. (unstack c d)
   deleted: (clear c) (handempty) (on c d)
   added: (holding c) (clear d)
   goals met: 6 of 12
34. (stack c j)
   deleted: (holding c) (clear j)
   added: (clear c) (handempty) (on c j)
   goals met: 7 of 12
35. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 7 of 12
36. (stack m c)
   deleted: (holding m) (clear c)
   added: (clear m) (handempty) (on m c)
   goals met: 8 of 12
37. (unstack l a)
   deleted: (clear l) (handempty) (on l a)
   added: (holding l) (clear a)
   goals met: 8 of 12
38. (stack l m)
   deleted: (holding l) (clear m)
   added: (clear l) (handempty) (on l m)
   goals met: 9 of 12
39. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 9 of 12
40. (stack e l)
   deleted: (holding e) (clear l)
   added: (clear e) (handempty) (on e l)
   goals met: 10 of 12
41. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 10 of 12
42. (stack a e)
   deleted: (holding a) (clear e)
   added: (clear a) (handempty) (on a e)
   goals met: 11 of 12
43. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 11 of 12
44. (stack d a)
   deleted: (holding d) (clear a)
   added: (clear d) (handempty) (on d a)
   goals met: 12 of 12
